In [1]:
import sys
sys.path.append('../../src/')
from utils import load_data, extract_title, group_titles

In [3]:
# =============================================================================
# 1. LOAD DATA
# =============================================================================

In [5]:
# Load datasets
train_df, test_df = load_data()

print("Dataset shapes:")
print(f"Training set: {train_df.shape}")
print(f"Test set: {test_df.shape}")

Dataset shapes:
Training set: (891, 12)
Test set: (418, 11)

In [7]:
# =============================================================================
# 2. EXPLORATORY DATA ANALYSIS
# =============================================================================

In [9]:
# Lets extract Titles
train_df['Title'] = train_df['Name'].map(extract_title)
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr

In [ ]:
# Check if some title is not mapped
train_df['Title'].isnull().sum()

In [13]:
title_age_stats = train_df.groupby('Title')['Age'].agg(['mean', 'median', 'count']).round(2)
print("\nAge by Title:")
print(title_age_stats)

Age by Title:
               mean  median  count
Title
Capt          70.00    70.0      1
Col           58.00    58.0      2
Don           40.00    40.0      1
Dr            42.00    46.5      6
Jonkheer      38.00    38.0      1
Lady          48.00    48.0      1
Major         48.50    48.5      2
Master         4.57     3.5     36
Miss          21.77    21.0    146
Mlle          24.00    24.0      2
Mme           24.00    24.0      1
Mr            32.37    30.0    398
Mrs           35.90    35.0    108
Ms            28.00    28.0      1
Rev           43.17    46.5      6
Sir           49.00    49.0      1
the Countess  33.00    33.0      1

In [ ]:
print("\n=== SURVIVAL RATE BY Title ===")
train_df.groupby('Title')['Survived'].agg(['mean', 'count'])

In [ ]:
train_df['Title_Group'] = train_df['Title'].apply(group_titles)
train_df.head()

In [ ]:
print(train_df['Title_Group'].value_counts())
print("\nSurvival rate por grupo:")
print(train_df.groupby('Title_Group')['Survived'].mean().sort_values(ascending=False))

In [ ]:
# Lets extract Titles
train_df['Title'] = train_df['Name'].map(extract_title)
train_df['Title_Group'] = train_df['Title'].apply(group_titles)
train_df.head()